docs/benchmark/results/lumen/ramp-up_output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/joey/api-gateway/lumen-gateway/docs/benchmark/k6/ramp-up.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 1m20s max duration (incl. graceful stop):
              * ramp: Up to 500 looping VUs for 50s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 013/500 VUs, 6363 complete and 0 interrupted iterations
ramp   [   2% ] 013/500 VUs  01.0s/50.0s

running (0m02.0s), 017/500 VUs, 14436 complete and 0 interrupted iterations
ramp   [   4% ] 017/500 VUs  02.0s/50.0s

running (0m03.0s), 021/500 VUs, 21720 complete and 0 interrupted iterations
ramp   [   6% ] 021/500 VUs  03.0s/50.0s

running (0m04.0s), 025/500 VUs, 30902 complete and 0 interrupted iterations
ramp   [   8% ] 025/500 VUs  04.0s/50.0s

running (0m05.0s), 029/500 VUs, 39691 complete and 0 interrupted iterations
ramp   [  10% ] 029/500 VUs  05.0s/50.0s

running (0m06.0s), 033/500 VUs, 48757 complete and 0 interrupted iterations
ramp   [  12% ] 033/500 VUs  06.0s/50.0s

running (0m07.0s), 037/500 VUs, 58370 complete and 0 interrupted iterations
ramp   [  14% ] 037/500 VUs  07.0s/50.0s

running (0m08.0s), 041/500 VUs, 67897 complete and 0 interrupted iterations
ramp   [  16% ] 041/500 VUs  08.0s/50.0s

running (0m09.0s), 045/500 VUs, 77665 complete and 0 interrupted iterations
ramp   [  18% ] 045/500 VUs  09.0s/50.0s

running (0m10.0s), 049/500 VUs, 87917 complete and 0 interrupted iterations
ramp   [  20% ] 049/500 VUs  10.0s/50.0s

running (0m11.0s), 054/500 VUs, 97897 complete and 0 interrupted iterations
ramp   [  22% ] 054/500 VUs  11.0s/50.0s

running (0m12.0s), 059/500 VUs, 106050 complete and 0 interrupted iterations
ramp   [  24% ] 059/500 VUs  12.0s/50.0s

running (0m13.0s), 064/500 VUs, 116297 complete and 0 interrupted iterations
ramp   [  26% ] 064/500 VUs  13.0s/50.0s

running (0m14.0s), 069/500 VUs, 127078 complete and 0 interrupted iterations
ramp   [  28% ] 069/500 VUs  14.0s/50.0s

running (0m15.0s), 074/500 VUs, 136742 complete and 0 interrupted iterations
ramp   [  30% ] 074/500 VUs  15.0s/50.0s

running (0m16.0s), 079/500 VUs, 148108 complete and 0 interrupted iterations
ramp   [  32% ] 079/500 VUs  16.0s/50.0s

running (0m17.0s), 084/500 VUs, 158939 complete and 0 interrupted iterations
ramp   [  34% ] 084/500 VUs  17.0s/50.0s

running (0m18.0s), 089/500 VUs, 169800 complete and 0 interrupted iterations
ramp   [  36% ] 089/500 VUs  18.0s/50.0s

running (0m19.0s), 094/500 VUs, 180406 complete and 0 interrupted iterations
ramp   [  38% ] 094/500 VUs  19.0s/50.0s

running (0m20.0s), 099/500 VUs, 191094 complete and 0 interrupted iterations
ramp   [  40% ] 099/500 VUs  20.0s/50.0s

running (0m21.0s), 109/500 VUs, 202049 complete and 0 interrupted iterations
ramp   [  42% ] 109/500 VUs  21.0s/50.0s

running (0m22.0s), 119/500 VUs, 213550 complete and 0 interrupted iterations
ramp   [  44% ] 119/500 VUs  22.0s/50.0s

running (0m23.0s), 129/500 VUs, 223190 complete and 0 interrupted iterations
ramp   [  46% ] 129/500 VUs  23.0s/50.0s

running (0m24.0s), 139/500 VUs, 235159 complete and 0 interrupted iterations
ramp   [  48% ] 139/500 VUs  24.0s/50.0s

running (0m25.0s), 149/500 VUs, 244744 complete and 0 interrupted iterations
ramp   [  50% ] 149/500 VUs  25.0s/50.0s

running (0m26.0s), 159/500 VUs, 254173 complete and 0 interrupted iterations
ramp   [  52% ] 159/500 VUs  26.0s/50.0s

running (0m27.0s), 169/500 VUs, 265483 complete and 0 interrupted iterations
ramp   [  54% ] 169/500 VUs  27.0s/50.0s

running (0m28.0s), 179/500 VUs, 276701 complete and 0 interrupted iterations
ramp   [  56% ] 179/500 VUs  28.0s/50.0s

running (0m29.0s), 189/500 VUs, 288475 complete and 0 interrupted iterations
ramp   [  58% ] 189/500 VUs  29.0s/50.0s

running (0m30.0s), 199/500 VUs, 299790 complete and 0 interrupted iterations
ramp   [  60% ] 199/500 VUs  30.0s/50.0s

running (0m31.0s), 209/500 VUs, 312191 complete and 0 interrupted iterations
ramp   [  62% ] 209/500 VUs  31.0s/50.0s

running (0m32.0s), 219/500 VUs, 324289 complete and 0 interrupted iterations
ramp   [  64% ] 219/500 VUs  32.0s/50.0s

running (0m33.0s), 229/500 VUs, 335916 complete and 0 interrupted iterations
ramp   [  66% ] 229/500 VUs  33.0s/50.0s

running (0m34.0s), 239/500 VUs, 347390 complete and 0 interrupted iterations
ramp   [  68% ] 239/500 VUs  34.0s/50.0s

running (0m35.0s), 249/500 VUs, 359796 complete and 0 interrupted iterations
ramp   [  70% ] 249/500 VUs  35.0s/50.0s

running (0m36.0s), 259/500 VUs, 371127 complete and 0 interrupted iterations
ramp   [  72% ] 259/500 VUs  36.0s/50.0s

running (0m37.0s), 269/500 VUs, 382634 complete and 0 interrupted iterations
ramp   [  74% ] 269/500 VUs  37.0s/50.0s

running (0m38.0s), 279/500 VUs, 395480 complete and 0 interrupted iterations
ramp   [  76% ] 279/500 VUs  38.0s/50.0s

running (0m39.0s), 289/500 VUs, 408181 complete and 0 interrupted iterations
ramp   [  78% ] 289/500 VUs  39.0s/50.0s

running (0m40.0s), 299/500 VUs, 420261 complete and 0 interrupted iterations
ramp   [  80% ] 299/500 VUs  40.0s/50.0s

running (0m41.0s), 319/500 VUs, 432411 complete and 0 interrupted iterations
ramp   [  82% ] 319/500 VUs  41.0s/50.0s

running (0m42.0s), 339/500 VUs, 442692 complete and 0 interrupted iterations
ramp   [  84% ] 339/500 VUs  42.0s/50.0s

running (0m43.0s), 359/500 VUs, 454680 complete and 0 interrupted iterations
ramp   [  86% ] 359/500 VUs  43.0s/50.0s

running (0m44.0s), 379/500 VUs, 466283 complete and 0 interrupted iterations
ramp   [  88% ] 379/500 VUs  44.0s/50.0s

running (0m45.0s), 399/500 VUs, 478057 complete and 0 interrupted iterations
ramp   [  90% ] 399/500 VUs  45.0s/50.0s

running (0m46.0s), 419/500 VUs, 489578 complete and 0 interrupted iterations
ramp   [  92% ] 419/500 VUs  46.0s/50.0s

running (0m47.0s), 439/500 VUs, 501699 complete and 0 interrupted iterations
ramp   [  94% ] 439/500 VUs  47.0s/50.0s

running (0m48.0s), 459/500 VUs, 514658 complete and 0 interrupted iterations
ramp   [  96% ] 459/500 VUs  48.0s/50.0s

running (0m49.0s), 479/500 VUs, 526263 complete and 0 interrupted iterations
ramp   [  98% ] 479/500 VUs  49.0s/50.0s

running (0m50.0s), 499/500 VUs, 539470 complete and 0 interrupted iterations
ramp   [ 100% ] 499/500 VUs  50.0s/50.0s


  █ TOTAL RESULTS 

    checks_total.......: 1080980 21603.71522/s
    checks_succeeded...: 100.00% 1080980 out of 1080980
    checks_failed......: 0.00%   0 out of 1080980

    ✓ status is 200
    ✓ body is not empty

    HTTP
    http_req_duration..............: avg=16.66ms min=301µs    max=135.6ms  p(50)=13.02ms p(75)=24.01ms p(95)=43.64ms p(99)=64.06ms count=540490
      { expected_response:true }...: avg=16.66ms min=301µs    max=135.6ms  p(50)=13.02ms p(75)=24.01ms p(95)=43.64ms p(99)=64.06ms count=540490
    http_req_failed................: 0.00%  0 out of 540490
    http_reqs......................: 540490 10801.85761/s

    EXECUTION
    iteration_duration.............: avg=16.71ms min=331.87µs max=135.65ms p(50)=13.08ms p(75)=24.06ms p(95)=43.69ms p(99)=64.13ms count=540490
    iterations.....................: 540490 10801.85761/s
    vus............................: 499    min=13          max=499
    vus_max........................: 500    min=500         max=500

    NETWORK
    data_received..................: 421 MB 8.4 MB/s
    data_sent......................: 175 MB 3.5 MB/s



running (0m50.0s), 000/500 VUs, 540490 complete and 0 interrupted iterations
ramp ✓ [ 100% ] 000/500 VUs  50s